 TEST: PROC (PARM) OPTIONS(MAIN) REORDER;
 
 DCL PARM CHAR(100) VARYING;
 
 DCL SYSPRINT PRINT STREAM ENV(V TEXT);
 
 OPEN FILE(SYSPRINT) TITLE('SYSPRINT');
 
    PUT SKIP LIST('Hello World!');
 
 CLOSE FILE(SYSPRINT);
 
 END TEST;
